Tekla.Structures.Analysis.AnalysisBeamEnd.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisBeamEnd class.

Tekla.Structures.Analysis.AnalysisBeamEnd.Profile
Gets or sets the profile at the beam end.

Tekla.Structures.Analysis.AnalysisBeamEnd.Eccentricity
Gets or sets the eccentricity at the beam end (in the member's local coordinate system).

Tekla.Structures.Analysis.AnalysisBeamEnd.Connectivity
Gets or sets the connectivity at the beam end.